src/Catalogs/ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателя</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Статусы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапрещеноИзменениеРеквизитов</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимОграниченияВзаимосвязей</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РежимыОграниченияВзаимосвязейГруппДоступаКСтатусамПроцессаВозвратов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаОграниченияВзаимосвязей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Взаимосвязь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателя/Ext/ManagerModule.bsl
Функция ДоступныеСтатусыТекущегоПользователя() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателяСтатусы.Статус
		|ИЗ
		|	Справочник.ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателя.Статусы КАК ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателяСтатусы
		|		Внутреннее СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателяСтатусы.Ссылка = Пользователи.ГруппаДоступаКСтатусамПроцессаВозвратаОтПокупателя
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка
		|	И НЕ ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателяСтатусы.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.ТекущийПользователь);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Статус");
		
КонецФункции

Функция СтатусДоступенТекущемуПользователю(Статус) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателяСтатусы.Статус
		|ИЗ
		|	Справочник.ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателя.Статусы КАК ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателяСтатусы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателяСтатусы.Ссылка = Пользователи.ГруппаДоступаКСтатусамПроцессаВозвратаОтПокупателя
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка
		|	И ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателяСтатусы.Статус = &Статус
		|	И НЕ ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателяСтатусы.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Статус", Статус);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
		
КонецФункции

//ХудинВВ 07052019 XX-2214
Функция ЗапрещеноИзменениеРеквизитовГруппойДоступности(Статус) Экспорт
	
	ЗапрещеноИзменениеРеквизитов = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателяСтатусы.ЗапрещеноИзменениеРеквизитов, ИСТИНА) КАК ЗапрещеноИзменениеРеквизитов
		|ИЗ
		|	Справочник.ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателя.Статусы КАК ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателяСтатусы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателяСтатусы.Ссылка = Пользователи.ГруппаДоступаКСтатусамПроцессаВозвратаОтПокупателя
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка
		|	И ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателяСтатусы.Статус = &Статус
		|	И НЕ ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателяСтатусы.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Статус", Статус);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗапрещеноИзменениеРеквизитов = Выборка.ЗапрещеноИзменениеРеквизитов;
	КонецЕсли;
	
	Возврат ЗапрещеноИзменениеРеквизитов;
		
КонецФункции
